       identification division.
       program-id. ex003.

       environment division.
       data division.
       
       procedure division.
           display "I am now in the other program." line 8 col 1.
           display "Let's go back to main." line 9 col 1.
           goback.

           stop run.

